# Assignment 9

## Try to submit as an HTML file

<font size = "5">
Print your Emory ID below

In [5]:
# Write your answer here:
print(2524612)

2524612

<font size = "5">

Import the "pandas" and 

"sqlalchemy","URL", and "text" libraries from "sqlalchemy" <br>

In [6]:
import pandas as pd
from sqlalchemy import URL
from sqlalchemy import text
from sqlalchemy import create_engine

<font size = "5">

Establish a connection to the SQL server and database ```postgres``` <br>
from Python as done in  class  using <br>
```URL()``` and ```create_engine()```<br>
As we are are in the default database, you can leave out the database argument.

In [7]:
server_url = URL.create(
    "postgresql",
    host = "127.0.0.1",
    database = "postgres",
    username = "postgres",
    port = 5432,
    password = "",
)

connection = create_engine(server_url)

<font size = "5">

In this homework, you will repeat most of the  exercises in <br>
Assignment 8, this time accessing SQL indirectly <br>
from Python

<font size = "3">

- For (a)-(e) read the section <br>
on "Escape Characters" carefully and how to write <br>
strings in multiple lines
- Ensure for each exercise you are using the specific Python commands(ie-pd.read_sql)


<font size = "5">

(a) Upload dataset to SQL


<font size = "3">

- Read the file "homework9_table.csv" in the "data_raw" folder
- Upload the file to your local SQL server using the <br>
"to_sql" command. Call the new file "sprint_results" in the <br>
server

In [8]:
sprint_results = pd.read_csv("data_raw/homework9_table.csv")
sprint_results.to_sql(
    "sprint_results",
    con = connection,
    if_exists = "replace",
    index = False
)

10


<font size = "5">

For questions (b)-(e) we will be working with the table <br>
``` homework9_table ``` in the SQL server. You are required to use <br>
the ```read_sql``` command for all the following questions.


<font size = "5">

(b) Subset and sort


<font size = "3">

- Use ```WHERE``` to get a subset of "homework9_table" to subset <br>
drivers whose nationality is British.
- Chain this with ```ORDER BY driver_name ASC``` to sort in <br>
ascending order <br>
Hints:
- Remember to include a  ```\```  to be able to define strings over multiple lines
- We can include single quotations in the WHERE command without any additional escape characters

In [9]:
pd.read_sql(
    text(
        "SELECT * FROM sprint_results \
        WHERE nationality = 'British'\
        ORDER BY driver_name ASC;"
    ),
    con = connection
)

   Unnamed: 0  driver_id     driver_name nationality  lap_times
0           5          6    Henry Louvre     British         32
1           4          5  Lewis Hamilton     British        103
2           0          1    Simon Cowell     British         74

<font size = "5">

(c) Groupby + Aggregate + Sort

<font size = "3">

- Obtain the average of "lap_times" by "driverId" using ```GROUP BY```
- Use ```ORDER BY ``` to sort by the average of "lap_times"
- Make sure to seperate pieces of your logic over seperate lines  by a ```\```

In [10]:
pd.read_sql(
    text(
        "SELECT AVG(\"lap_times\") FROM sprint_results\
        GROUP BY \"driver_id\"\
        ORDER BY AVG(\"lap_times\");"
    ),
    con = connection
)

     avg
0   11.0
1   24.0
2   26.0
3   32.0
4   53.0
5   74.0
6   82.0
7   87.0
8   91.0
9  103.0

<font size = "5">

(d) Groupby + Aggregate + Sort

<font size = "3">

- Obtain the sum of "lap_times" by nationality using ```GROUP BY```
- Use ```HAVING ``` to filter nationalities with a sum <br>
of lap times strictly higher than 150
- Make sure to seperate pieces of your logic over seperate lines  by a ```\```



HINT: See the end of lecture 16 for details <br>
HINT: Use ```HAVING SUM(lap_times)``` rather than an alias <br>
for the code to work correctly.

In [11]:
pd.read_sql(
    text(
        "SELECT SUM(\"lap_times\") FROM sprint_results\
        GROUP BY \"nationality\"\
        HAVING SUM(\"lap_times\") > 150;"
    ),
    con = connection
)

     sum
0  261.0
1  209.0

<font size = "5">

(e) Groupby and multiple aggregations

<font size = "3">

- In this exercise we will obtain multiple statistics about each nationality and their lap times.
-  Obtain the sum, min, max, and range of each nationality's lap times using ```GROUP BY```
- Make sure to separate pieces of your code by a ```\``` <br>
HINT: There is no built in range function in SQL, however you can use the <br>
MAX and MIN functions to build your own function, like this:

``` MAX(lap_times)-MIN(lap_times) AS range_laptimes```

In [12]:
pd.read_sql(
    text(
        "SELECT SUM(\"lap_times\"), MIN(\"lap_times\"), MAX(\"lap_times\"), MAX(\"lap_times\") - MIN(\"lap_times\") AS \"range_lap_times\" FROM sprint_results\
        GROUP BY \"nationality\""
    ),
    con = connection
)

     sum  min  max  range_lap_times
0  261.0   11   91               80
1  113.0   26   87               61
2  209.0   32  103               71